// import db

export async function GET() {
	// connect to db to fetch & parse data

	const blogs = [
		{
			id: 1,
			imgUrl: '/images/p2.jpg',
			title: 'ဇေတော်ဝင််မီးယပ်သွေးပုပ်ချဆေး',
			intro: `သုံးဆွဲသူတွေအလွယ်တစ်ကူသုံးဆွဲနိုင်ဖို့ဆေးပစ္စည်းများကိုအရည်သွေးကောင်းမွန်ပြီးစျေးနှုန်းသင်တင့်စွာဖြင့်ရောင်းချပေးနေပါပြီ။`
		},
		{
			id: 2,
			imgUrl: '/images/p3.jpg',
			title: 'ဇေတဝန်အကြောဖြေရှောက်ပေါင်းလိမ်းဆေး',
			intro: `ဘေးထွက်ဆိုးကျိုးမပါဘဲသဘာဝဆေးဖက်ဝင်ပစ္စည်းများဖြင့်သာအချိုးကျဖော်စပ်ထားတာဖြစ်တဲ့အတွက်ကြောင့်ယုံကြည်စိတ်ချစွာသုံးဆွဲနိုင်ပါတယ်။`
		},
		{
			id: 3,
			imgUrl: '/images/p1.jpg',
			title: 'ဇေတဝန်အားတိုးဆေး',
			intro: `ဆေးပစ္စည်းတွေကိုသန့်ရှင်းသပ်ရပ်စွာထုတ်ပိုးထားတဲ့အတွက်ကြာရှည်အထားခံပါတယ်။`
		}
	];

	return {
		status: 200,
		body: { blogs }
	};
}
